Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
/*
 * project2.c
 *
 *  Created on: Apr 10, 2025
 *      Author: turtl
 */

#include <stdio.h>

#include "project2.h"
#include "nrfModule.h"
#include "wait.h"
#include "timer.h"

#include "uart0.h"
#include "tm4c123gh6pm.h"

void initP2(){
    p2CurrentFrame = 0;
    p2TxEndpoint = 0;
    p2State = P2_STATE_OFF;
    newFrame = false;

    // init frame timer

    // Enable clocks
    SYSCTL_RCGCTIMER_R |= SYSCTL_RCGCTIMER_R3;
    _delay_cycles(3);
    // Configure Timer 3 for 1uS tick
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer before reconfiguring
}

void p2HostStart(){
    p2State = P2_STATE_HOST_START;
    p2TxEndpoint = P2_SYNC_FRAME_INDEX;

    for(uint8_t i = 0; i < P2_FRAME_COUNT; i++){
        p2FrameMetas[i].ttl = 0;
    }
}

void p2ClientJoin(){
    p2State = P2_STATE_CLIENT_START;
    p2TxEndpoint = P2_SYNC_FRAME_INDEX;
}

bool p2IsFrameStartSetting(){
    if(newFrame){
        newFrame = false;
        return true;
    }

    return false;
}

void p2HostLoop(){

    bool isFrameStart  = p2IsFrameStartSetting();

    switch(p2State){
        case P2_STATE_HOST_START: {

                p2State = P2_STATE_HOSTING;

                isFrameStart = true;
            }
        case P2_STATE_HOSTING: {

                if(isFrameStart){
                    // send frame start signal
                    p2PrintFrameMetas();
                    putsUart0("\n\r");

                    // send synch packet at start of each frame
                    p2Pkt pkt;
                    pkt.header.from_frame = p2TxEndpoint;
                    pkt.header.type = P2_TYPE_ENTRY_SYNCH_PKT;
                    P2DATAAS(p2PktSynch, pkt)->frame = p2CurrentFrame;

                    // ttl of current frame
                    P2DATAAS(p2PktSynch, pkt)->frame_ttl = p2FrameMetas[P2DATAAS(p2PktSynch, pkt)->frame].ttl;

                    {
                        // search for free frames
                        P2DATAAS(p2PktSynch, pkt)->next_avaliable_frame = P2DATAAS(p2PktSynch, pkt)->frame;
                        bool foundFrame = false;
                        for(uint8_t i = 1; i < P2_FRAME_COUNT && !foundFrame; i++){
                            uint8_t testFrame = (P2DATAAS(p2PktSynch, pkt)->next_avaliable_frame + i) % P2_FRAME_COUNT;

                            // if is syn frame
                            if(testFrame == P2_SYNC_FRAME_INDEX)
                                continue;

                            // if is occupied frame
                            if(p2FrameMetas[testFrame].ttl)
                                continue;

                            foundFrame = true;
                            P2DATAAS(p2PktSynch, pkt)->next_avaliable_frame = testFrame;
                        }

                        // if did not find a free frame send the sync frame index to indicate no space
                        if(!foundFrame)
                            P2DATAAS(p2PktSynch, pkt)->next_avaliable_frame = P2_SYNC_FRAME_INDEX;
                    }
                    pkt.header.crc = p2CalcPacketCRC(&pkt);
                    nrfConfigAsTransmitterChecked();
                    nrfTransmit(pkt.raw_arr, P2_MAX_PKT_SIZE);

                    // timer to next frame
                    p2StartFrameTimerUS(P2_T_FRAME_US);

                    // ttl calculations for the FORMER frame, not the current one
                    {
                        // get former frame
                        uint8_t frameid = P2DATAAS(p2PktSynch, pkt)->frame ? P2DATAAS(p2PktSynch, pkt)->frame : P2_FRAME_COUNT;
                        frameid -= 1;

                        // if not the host frame
                        if(frameid != P2_SYNC_FRAME_INDEX){

                            // if frame is known active
                            if(p2FrameMetas[frameid].ttl){
                                // decrement
                                p2FrameMetas[frameid].ttl -= 1;

                                // if frame timed out
                                if(p2FrameMetas[frameid].ttl == 0){
                                    // queue a reset message
                                    putsUart0("\n\r reset cmd to frame ");
                                    {
                                        char str[6];
                                        snprintf(str, sizeof(str), "%02d", frameid);
                                        putsUart0(str);
                                    }
                                    putsUart0(" for timeout");

                                    p2Pkt p;
                                    p.header.type = P2_TYPE_CMD_RESET;
                                    p.header.from_frame = P2_SYNC_FRAME_INDEX;
                                    p.header.data_length = sizeof(p2PktReset);
                                    P2DATAAS(p2PktReset, p)->frame = frameid;
                                    p.header.crc = p2CalcPacketCRC(&p);

                                    if(p2PushMsgQueue(p)){
                                        // successfully added to queue
                                    } else {
                                        // something wrong with queue, stop this connection later
                                        p2FrameMetas[frameid].ttl = 1;
                                    }
                                }
                            }
                        }
                    }

                    // toggle on synch packet
                    togglePinValue(GREEN_LED);

                } else if(p2CurrentFrame != P2_SYNC_FRAME_INDEX){
                    // receive messages each frame
                    nrfConfigAsReceiverChecked();

                    if(nrfIsDataAvaliable()){

                        p2Pkt pkt;
                        if(nrfGetRXData(pkt.raw_arr, sizeof(p2Pkt))){

                            bool isValid;
                            if(isValid = p2IsPacketValid(&pkt)){

                                // TTL updates
                                if(pkt.header.type == P2_TYPE_CMD_JOIN_REQUEST){
                                    p2HostProcessPacket(&pkt);
                                } else {
                                    // reset TTL if packet received from a live frame
                                    if(p2FrameMetas[pkt.header.from_frame].ttl != 0){

                                        p2FrameMetas[pkt.header.from_frame].ttl = P2_FRAME_DEFAULT_TTL;
                                        p2HostProcessPacket(&pkt);
                                    } else {
//                                        // packet from unexpected frame, send back a reset
//                                        isValid = false;
//                                        putsUart0("packet from unoccupied frame ");
//                                        {
//                                            char str[8];
//                                            snprintf(str, sizeof(str), "%02d\n\r", pkt.header.from_frame);
//                                            putsUart0(str);
//                                        }
//
//                                        // fake receive a reset packet
//                                        p2Pkt p;
//                                        p.header.type = P2_TYPE_CMD_RESET;
//                                        p.header.data_length = sizeof(p2PktReset);
//                                        P2DATAAS(p2PktReset, p)->frame = pkt.header.from_frame;
//                                        P2DATAAS(p2PktReset, p)->isEcho = false;
//
//                                        p.header.crc = p2CalcPacketCRC(&p);
//                                        p2HostProcessPacket(&pkt);
                                    }
                                }
                            }

                            putsUart0("hostRX; valid  ");
                            putcUart0('0' + isValid);
                            putsUart0(", ");
                            p2PrintPacket(&pkt);
                            putsUart0("\n\r");
                        }
                    }
                } else {
                    // server transmit time

                    nrfConfigAsTransmitterChecked();

