Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
                    p2MsgQEntry * toSend = p2PopMsgQueue();
                    if(toSend){
                        nrfTransmit(toSend->pkt.raw_arr, P2_MAX_PKT_SIZE);
                    }
                }

            } break;
        default:;
    };
}

void p2ClientLoop(){
    bool isFrameStart  = p2IsFrameStartSetting();

    switch(p2State){
        case P2_STATE_CLIENT_START: {
                // wait for synch
                // stall in this stage until so

                nrfConfigAsReceiverChecked();

                if(nrfIsDataAvaliable()){

                    p2Pkt pkt;
                    if(nrfGetRXData(pkt.raw_arr, sizeof(p2Pkt))){

                        bool isValid = p2IsPacketValid(&pkt);
                        if(isValid){

                            if(pkt.header.type == P2_TYPE_ENTRY_SYNCH_PKT){

                                // if no endpoint targeted
                                if(p2TxEndpoint == P2_SYNC_FRAME_INDEX){
                                    // get next available

                                    // contention resolution
                                    bool backoff = false;
                                    {
                                        // discount back off algo
                                        // 50/50, no resolution check, good er nuff
                                        backoff = (random32() & BV(0)) != 0;
                                    }

                                    if(backoff){
                                        putsUart0("backing off sync\n\r");
                                    } else {
                                        putsUart0("possible endpoit found\n\r");
                                        p2TxEndpoint = P2DATAAS(p2PktSynch, pkt)->next_avaliable_frame;
                                    }

                                } else // if is targeted endpoint
                                if(P2DATAAS(p2PktSynch, pkt)->frame == p2TxEndpoint){
                                    putsUart0("sending join request\n\r");
                                    // send join request

                                    p2Pkt p;
                                    p.header.type = P2_TYPE_CMD_JOIN_REQUEST;
                                    p.header.from_frame = p2TxEndpoint;
                                    P2DATAAS(p2PktJoinRq, p)->frame = p2TxEndpoint;
                                    p.header.data_length = sizeof(p2PktJoinRq);

                                    p.header.crc = p2CalcPacketCRC(&p);

                                    nrfConfigAsTransmitter();
                                    nrfTransmit(p.raw_arr, P2_MAX_PKT_SIZE);

                                    p2State = P2_STATE_CLIENT_WAIT_CONN_ACK;
                                    putsUart0("P2_STATE_CLIENT_WAIT_CONN_ACK\n\r");

                                    p2IsFrameStartSetting(); // reset timeout
                                    // start RTC time out for one more than it the cycles should time out
                                    p2StartFrameTimerUS(P2_T_FRAME_US * P2_FRAME_COUNT * (P2_SERVER_RESPONSE_TIMEOUT_CYCLES + 1));
                                } else {
                                    putsUart0("not the TXEP\n\r");
                                }
                            }

                        }

                        putsUart0("client_start RX; valid : ");
                        putcUart0('0' + isValid);
                        putsUart0(" , TXEP: ");
                        {
                            char str[6];
                            snprintf(str, sizeof(str), "%02d| ", p2TxEndpoint);
                            putsUart0(str);
                        }
                        p2PrintPacket(&pkt);
                        putsUart0("\n\r");
                    }
                }

            }break;
        case P2_STATE_CLIENT_WAIT_CONN_ACK:{
                /*
                 * wait for host to accept/deny join request
                 *
                 * if join request denied or timed out
                 *      go back to join search state
                 * else
                 *      move to active join state
                 */

                // timeout logic
                static uint8_t response_timeout;
                // if "its over" then "pack it up" (the nasdaq(host) has fallen(bad))
                if(response_timeout >= P2_SERVER_RESPONSE_TIMEOUT_CYCLES || p2IsFrameStartSetting()){
                    response_timeout = 0;
                    p2ClientJoin();
                    break;
                }

                nrfConfigAsReceiverChecked();

                if(nrfIsDataAvaliable()){
                    p2Pkt pkt;
                    if(nrfGetRXData(pkt.raw_arr, sizeof(p2Pkt))){

                        bool isValid;

                        if(isValid = p2IsPacketValid(&pkt)){

                            // if is from host
                            if(pkt.header.from_frame == P2_SYNC_FRAME_INDEX){

                                switch(pkt.header.type){

                                    // is response to join request
                                    case P2_TYPE_CMD_JOIN_RESPONSE:
                                        // if is addressing the frame of interest
                                        if(P2DATAAS(p2PktJoinResponse, pkt)->frame == p2TxEndpoint){
                                            response_timeout = 0;

                                            if(P2DATAAS(p2PktJoinResponse, pkt)->join_request_accepted){
                                                p2StopFrameTimer();
                                                p2State = P2_STATE_CLIENTING; // yippie
                                                putsUart0("P2_STATE_CLIENTING transition, yuppie\n\r");
                                                p2CurrentFrame = P2_SYNC_FRAME_INDEX; // set to some invlaid frame
                                            }
                                            else
                                                p2ClientJoin(); // nayy

                                            p2StopFrameTimer();
                                        }
                                        break;

                                    // the beacon does not respond ... its ever slightly more over
                                    case P2_TYPE_ENTRY_SYNCH_PKT:
                                        response_timeout += 1;
                                        break;

                                    default:
                                        break;
                                }
                            }
                        }

                        putsUart0("client_wait_con_ack RX; valid : ");
                        putcUart0('0' + isValid);
                        putsUart0(" ");
                        p2PrintPacket(&pkt);
                        putsUart0("\n\r");
                    }
                }
            }break;
        case P2_STATE_CLIENTING: {

                    // if time for this client to TX
                    if(p2CurrentFrame == p2TxEndpoint){
                        // tx pending messages

