Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
                        p2MsgQEntry * toSend = p2PopMsgQueue();
                        if(toSend){
                            nrfTransmit(toSend->pkt.raw_arr, P2_MAX_PKT_SIZE);
                        }

                        setPinValue(GREEN_LED, 1);
                    }
                    else
                    {
                        setPinValue(GREEN_LED, 0);

                        bool isValid;
                        p2Pkt pkt;
                        if(p2GetData(&pkt, &isValid)){

                            // if is valid data
                            if(isValid){

                                switch(pkt.header.type){
                                        // timing synchronization
                                        case P2_TYPE_ENTRY_SYNCH_PKT: {
                                            // if is NOT form host
                                            if(pkt.header.from_frame != P2_SYNC_FRAME_INDEX)
                                                break;

                                            // update local info using this packet, everyone trusts the same source
                                            p2CurrentFrame = P2DATAAS(p2PktSynch, pkt)->frame;
                                            if(p2CurrentFrame == p2TxEndpoint){
                                                nrfConfigAsTransmitterChecked();
                                                p2StartFrameTimerUS(P2_T_FRAME_TX_US);
                                                break;
//                                                p2MsgQEntry * toSend = p2PopMsgQueue();
//                                                if(toSend){
//                                                    nrfConfigAsTransmitter();
//                                                    nrfTransmit(toSend->pkt.raw_arr, P2_MAX_PKT_SIZE);
//                                                    nrfConfigAsReceiver();
//                                                }
//
//                                                setPinValue(GREEN_LED, 1);
                                            }

                                            // if is addressing the frame were occupying
                                            if(P2DATAAS(p2PktSynch, pkt)->frame == p2TxEndpoint){
                                                if(P2DATAAS(p2PktSynch, pkt)->frame_ttl == 0){
                                                    // must have missed a reset packet
                                                    // restart
                                                    p2ClientJoin();
                                                    break;
                                                }

                                                // if near timeout
                                                if(P2DATAAS(p2PktSynch, pkt)->frame_ttl <= 4){
                                                    // send keepalive message to prevent timeout
                                                    p2Pkt p;
                                                    p.header.type = P2_TYPE_CMD_KEEPALIVE;
                                                    p.header.data_length = sizeof(p2PktKeepAlive);
                                                    p.header.from_frame = p2TxEndpoint;
                                                    P2DATAAS(p2PktKeepAlive, p)->newTTL = 10; // use server default
                                                    p2PushMsgQueue(p);
                                                }

                                            }
                                        } break;

                                        default:;
                                }

                                p2ClientProcessPacket(&pkt);

                            }

                            putsUart0("clienting@");
                            {
                               char str[5];
                               snprintf(str, sizeof(str), "%2d ", p2TxEndpoint);
                               putsUart0(str);
                            }
                            {
                                char str[15];
                                snprintf(str, sizeof(str), "cf: %02d | ", p2CurrentFrame);
                                putsUart0(str);
                            }
                            putsUart0(" RX; valid: ");
                            putcUart0('0' + isValid);
                            putsUart0(" ");
                            p2PrintPacket(&pkt);
                            putsUart0("\n\r");
                        }
                    }
                } break;
        default:;
    };
}

void p2HostProcessPacket(p2Pkt const * pkt){
    // assume packet is good

    switch(pkt->header.type){
        case P2_TYPE_CMD_JOIN_REQUEST:{
                // data validation
                bool isValid = true;
                {
                    if(
                                P2DATAAS(p2PktJoinRq, *pkt)->frame >= P2_FRAME_COUNT
                            ||  P2DATAAS(p2PktJoinRq, *pkt)->frame == p2TxEndpoint
                      ) {
                        isValid = false;
                    }
                }

                p2Pkt p;
                p.header.from_frame = p2TxEndpoint;
                p.header.data_length = sizeof(p2PktJoinResponse);
                p.header.type = P2_TYPE_CMD_JOIN_RESPONSE;

                uint8_t sourceFrame = P2DATAAS(p2PktJoinRq, *pkt)->frame;
                P2DATAAS(p2PktJoinResponse, p)->frame = sourceFrame;

                // accept if frame not already occupied
                P2DATAAS(p2PktJoinResponse, p)->join_request_accepted =
                        isValid ?
                                (p2FrameMetas[sourceFrame].ttl == 0)
                        :       false;

                // if accepting
                if(P2DATAAS(p2PktJoinResponse, p)->join_request_accepted){
                    // make sure no double accepting
                    for(uint8_t i = 0; i < P2_MSG_QUEUE_SIZE; i++){
                        if(p2MsgQueue[i].enabled && p2MsgQueue[i].pkt.header.type == P2_TYPE_CMD_JOIN_RESPONSE){
                            P2DATAAS(p2PktJoinResponse, p2MsgQueue[i].pkt)->join_request_accepted = false;
                            break;
                        }
                    }
                    p2FrameMetas[sourceFrame].ttl = P2_FRAME_DEFAULT_TTL;
                }

                p.header.crc = p2CalcPacketCRC(&p);
                p2PushMsgQueue(p);
            }break;

        case P2_TYPE_CMD_RESET:
            if(P2DATAAS(p2PktReset, *pkt)->isEcho){

            } else {
                // send reset packet with isEcho true
                p2Pkt p;
                p.header.from_frame = p2TxEndpoint;
                p.header.data_length = sizeof(p2PktReset);
                p.header.type = P2_TYPE_CMD_RESET;
                P2DATAAS(p2PktReset, p)->frame = pkt->header.from_frame;
                P2DATAAS(p2PktReset, p)->isEcho = true;
                p2PushMsgQueue(p);
            }
        case P2_TYPE_CMD_DISCONNNECT:
            p2FrameMetas[pkt->header.from_frame].ttl = 0;
            break;

        case P2_TYPE_CMD_KEEPALIVE: {
                if(P2DATAAS(p2PktSynch, *pkt)->frame_ttl)
                    p2FrameMetas[pkt->header.from_frame].ttl = P2DATAAS(p2PktSynch, *pkt)->frame_ttl;
                else
                    p2FrameMetas[pkt->header.from_frame].ttl = 6;
            }break;

        case P2_TYPE_CMD_JOIN_RESPONSE:
        case P2_TYPE_ENTRY_SYNCH_PKT:
            // do nothing. should only occur if multiple hosts are running. systems screwed up anyways
            break;
        case P2_TYPE_GLASS_BRAKE_SENSOR:
            putsUart0("glass broke!\n\r");
            break;

        default:
            putsUart0("unhandled type ");
            break;

