Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
    }
}

void p2ClientProcessPacket(p2Pkt const * pkt){
    // assume packet is good

    switch(pkt->header.type){
        case P2_TYPE_CMD_JOIN_RESPONSE:
            break;

        case P2_TYPE_CMD_RESET: {
                    // if intended for this frame
                    if(P2DATAAS(p2PktReset, *pkt)->frame != p2TxEndpoint)
                        break;

                    // disconnect
                    p2StopFrameTimer();
                    p2State = P2_STATE_OFF;

                    // if is not a retransmission
                    if(! P2DATAAS(p2PktReset, *pkt)->isEcho){
                        // send disconnect msg back to ensure both parties understand

                        p2Pkt p;
                        p.header.type = P2_TYPE_CMD_RESET;
                        p.header.from_frame = p2TxEndpoint;
                        p.header.data_length = sizeof(p2PktReset);
                        P2DATAAS(p2PktReset, p)->isEcho = true;
                        P2DATAAS(p2PktReset, p)->frame = p2TxEndpoint;

                        // mild effort to echo back the message
                        if(p2PushMsgQueue(p)){
                            // great success!
                        } else {
                            // it didn't make it, oh well, we did our due diligence ... thats what the timeout's for
                        }
                    }

                    // restart connection locally
                    p2ClientJoin();
                } break;

        case P2_TYPE_CMD_DISCONNNECT:
            // if intended for this device
            if(P2DATAAS(p2PktDisconnect, *pkt)->frame != p2TxEndpoint)
                break;

            // disconnect locally
            p2StopFrameTimer();
            p2State = P2_STATE_OFF;

            // restart connection locally
            p2ClientJoin();

            break;

        case P2_TYPE_CMD_JOIN_REQUEST:
            // do nothing
            putsUart0("received msg intended for server??\n\r");
            break;

        case P2_TYPE_ENTRY_SYNCH_PKT:
            // un oh, desync
            if(random32() & BV(5)){
                putsUart0("queuing alarm!\n\r");
                p2Pkt p;
                p.header.data_length = sizeof(p2PktEPGlassBreakSensor);
                p.header.type = P2_TYPE_GLASS_BRAKE_SENSOR;
                p.header.from_frame = p2TxEndpoint;
                p2PktEPGlassBreakSensor * gbs = P2DATAAS(p2PktEPGlassBreakSensor, p);
                gbs->alarm = random32() & BV(0);
                gbs->battery_level = random32() % 101;
                gbs->battery_low = gbs->battery_level <= 20;

                p2PushMsgQueue(p);
            }
            break;

        default:{
                char str[10];
                putsUart0("unhandled type ");
                snprintf(str, sizeof(str), "%02d, ", pkt->header.type);
                putsUart0(str);
            }break;
    }

}

p2MsgQEntry * p2PushMsgQueue(p2Pkt pkt){

    for(uint8_t i = 1; i < P2_MSG_QUEUE_SIZE; i++)
        if(!p2MsgQueue[i].enabled){
            p2MsgQueue[i].enabled = true;

            pkt.header.crc = p2CalcPacketCRC(&pkt);
            p2MsgQueue[i].pkt = pkt;

            return p2MsgQueue + i;
        }

    return NULL;
}

p2MsgQEntry * p2PopMsgQueue(){
    for(uint8_t i = 0; i < P2_MSG_QUEUE_SIZE; i++)
        if(p2MsgQueue[i].enabled){
            p2MsgQueue[i].enabled = false;
            return p2MsgQueue + i;
        }

    return NULL;
}

bool p2IsMsgQueueEmpty(){
    for(uint8_t i = 0; i < P2_MSG_QUEUE_SIZE; i++)
            if(p2MsgQueue[i].enabled)
                return false;
    return true;
}

bool p2IsPacketValid(p2Pkt const * pkt){
    return
            pkt->header.from_frame < P2_FRAME_COUNT
        &&  pkt->header.type <= P2_TYPE_LAST
        &&  pkt->header.crc == p2CalcPacketCRC(pkt)
        ;
}

// baselined off of Jason Losh's "initTimer()" function
void p2StartFrameTimerUS(uint32_t timeToNextFrame_us){
    // Enable clocks
    SYSCTL_RCGCTIMER_R |= SYSCTL_RCGCTIMER_R3;
    _delay_cycles(3);
    // Configure Timer 3 for 1uS tick
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer before reconfiguring
    TIMER3_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER3_TAMR_R = TIMER_TAMR_TAMR_1_SHOT;          // configure for one shot mode (count down)
    TIMER3_TAILR_R = timeToNextFrame_us * 40;        // set load value
    TIMER3_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    TIMER3_IMR_R |= TIMER_IMR_TATOIM;                // turn-on interrupt
    NVIC_EN1_R |= 1 << (INT_TIMER3A-(32+16));        // turn-on interrupt 51 (TIMER3A)
}

void p2StopFrameTimer(){
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer
}

bool p2IsFrameTimerRunning(){
    return (TIMER3_CTL_R & TIMER_CTL_TAEN) && (TIMER3_IMR_R & TIMER_IMR_TATOIM) && (TIMER3_TAILR_R > 0);
}

void p2OnFrameTimeIsr(){
    p2CurrentFrame += 1;
    p2CurrentFrame %= P2_FRAME_COUNT;
    newFrame = true;

    TIMER3_ICR_R = TIMER_ICR_TATOCINT;
}

void p2PrintPacket(p2Pkt const * p){
    putsUart0("{");

    char str[10];

    putsUart0("crc: ");
    snprintf(str, sizeof(str), "%02x, ", p->header.crc);
    putsUart0(str);

    putsUart0("len: ");
    snprintf(str, sizeof(str), "%02d, ", p->header.data_length);
    putsUart0(str);

    putsUart0("frame: ");
    snprintf(str, sizeof(str), "%02d, ", p->header.from_frame);
    putsUart0(str);

    putsUart0("type: ");
    switch(p->header.type){
        case P2_TYPE_CMD_RESET:
            putsUart0("CMD_RESET ,");
            putsUart0("frame: ");
            snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktReset, (*p))->frame);
            putsUart0(str);
            putsUart0("echo: ");
            putcUart0('0' + (P2DATAAS(p2PktReset, (*p))->isEcho ? 1 : 0));
            break;
        case P2_TYPE_CMD_DISCONNNECT:
            putsUart0("CMD_DISCONNNECT ,");
            break;
        case P2_TYPE_CMD_JOIN_REQUEST:{
                putsUart0("CMD_JOIN_REQUEST ,");
                putsUart0("frame: ");
                snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktJoinRq, (*p))->frame);
                putsUart0(str);
            }break;
        case P2_TYPE_CMD_JOIN_RESPONSE:
            putsUart0("CMD_JOIN_RESPONSE ,");
            putsUart0("frame: ");
            snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktJoinResponse, (*p))->frame);
            putsUart0(str);
            putsUart0("accepted: ");
            putcUart0('0' + P2DATAAS(p2PktJoinResponse, (*p))->join_request_accepted);
            break;
        case P2_TYPE_CMD_KEEPALIVE:
            putsUart0("CMD_KEEPALIVE ,");
            putsUart0("new TTL: ");
            snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktKeepAlive, *p)->newTTL);
            putsUart0(str);
            break;
        case P2_TYPE_ENTRY_SYNCH_PKT:{
                putsUart0("ENTRY_SYNCH_PKT ,");
                p2PktSynch * s = (p2PktSynch *)p->data;
                putsUart0("of frame: ");
                snprintf(str, sizeof(str), "%02d, ", s->frame);
                putsUart0(str);
                putsUart0("nxt avl frme: ");
                snprintf(str, sizeof(str), "%02d, ", s->next_avaliable_frame);
                putsUart0(str);
                putsUart0("frame ttl: ");
                snprintf(str, sizeof(str), "%02d, ", s->frame_ttl);
                putsUart0(str);
            }break;
        case P2_TYPE_GLASS_BRAKE_SENSOR:{
                putsUart0("GLASS_BRAKE_SENSOR ,");
                putsUart0("alarm: ");
                snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->alarm);
                putsUart0(str);
                putsUart0("batt low: ");
                snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->battery_low);
                putsUart0(str);
                putsUart0("batt level: ");
                snprintf(str, sizeof(str), "%03d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->battery_level);
                putsUart0(str);
            }break;
        case P2_TYPE_WEATHER_STATION:{
                putsUart0("WEATHER_STATION ,");
                putsUart0("data type: ");
                switch(P2DATAAS(p2PktWeatherStation, *p)->data_type){
                    case P2WSDT_KEEP_ALIVE: putsUart0("KEEP_ALIVE, "); break;
                    case P2WSDT_WIND_SPEED: putsUart0("WIND_SPEED, "); break;
                    case P2WSDT_WIND_DIRECITON: putsUart0("WIND_DIRECITON, "); break;
                    case P2WSDT_TEMPERATURE: putsUart0("TEMPERATURE, "); break;
                    case P2WSDT_HUMIDITY: putsUart0("HUMIDITY, "); break;
                    case P2WSDT_PRESSURE: putsUart0("PRESSURE, "); break;
                    default: {
                            putsUart0("unknown (");
                            snprintf(str, sizeof(str), "%d), ", P2DATAAS(p2PktWeatherStation, *p)->data_type);
                        } break;
                }
                putsUart0("str : ");
                for(uint8_t i = 0; i < sizeof(p->data) && p->data[i] != '\0'; i++)
                    putcUart0(p->data[i]);
            }break;
        default:{
                putsUart0("unknown (");
                snprintf(str, sizeof(str), "%02d) ", p->header.type);
                putsUart0(str);

